spec/fixtures/stripe_events/customer_subscription_created.json

{
  "id": "evt_1QP6CAKvFeX4s4udBhiaRFou",
  "object": "event",
  "api_version": "2024-10-28.acacia",
  "created": 1732556134,
  "data": {
    "object": {
      "id": "sub_1QP6g6KvFeX4s4udFvSJLuTa",
      "object": "subscription",
      "application": null,
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false,
        "liability": null
      },
      "billing_cycle_anchor": 1733152226,
      "billing_cycle_anchor_config": null,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "cancellation_details": {
        "comment": null,
        "feedback": null,
        "reason": null
      },
      "collection_method": "send_invoice",
      "created": 1733152226,
      "currency": "eur",
      "current_period_end": 1735830626,
      "current_period_start": 1733152226,
      "customer": "cus_RHfnYDKffI7ob7",
      "days_until_due": 5,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [

      ],
      "description": null,
      "discount": null,
      "discounts": [

      ],
      "ended_at": null,
      "invoice_settings": {
        "account_tax_ids": null,
        "issuer": {
          "type": "self"
        }
      },
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_RHfX9cLhEqUb1r",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1733152226,
            "discounts": [

            ],
            "metadata": {
            },
            "plan": {
              "id": "price_1QMbQaKvFeX4s4udng70Kivu",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2000,
              "amount_decimal": "2000",
              "billing_scheme": "per_unit",
              "created": 1731961208,
              "currency": "eur",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "meter": null,
              "nickname": null,
              "product": "prod_RF5bHsE8eohoFm",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1QMbQaKvFeX4s4udng70Kivu",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1731961208,
              "currency": "eur",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_RF5bHsE8eohoFm",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "meter": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 2000,
              "unit_amount_decimal": "2000"
            },
            "quantity": 1,
            "subscription": "sub_1QP6g6KvFeX4s4udFvSJLuTa",
            "tax_rates": [

            ]
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1QP6g6KvFeX4s4udFvSJLuTa"
      },
      "latest_invoice": "in_1QP6C9KvFeX4s4udIegg82n0",
      "livemode": false,
      "metadata": {
      },
      "next_pending_invoice_item_invoice": null,
      "on_behalf_of": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "price_1QMbQaKvFeX4s4udng70Kivu",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 2000,
        "amount_decimal": "2000",
        "billing_scheme": "per_unit",
        "created": 1731961208,
        "currency": "eur",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "meter": null,
        "nickname": null,
        "product": "prod_RF5bHsE8eohoFm",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1733152226,
      "status": "active",
      "test_clock": "clock_1QP3vxKvFeX4s4udgiySyLaP",
      "transfer_data": null,
      "trial_end": null,
      "trial_settings": {
        "end_behavior": {
          "missing_payment_method": "create_invoice"
        }
      },
      "trial_start": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_wVSvC7npiEK2pr",
    "idempotency_key": "6478d3d8-d73c-4355-b8aa-fba8866b015c"
  },
  "type": "customer.subscription.created"
}